AWS_RedisCluster/6_redis/4Stress_hdd4.txt
====== PING_INLINE ======
  100000 requests completed in 5.20 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
24.34% <= 2 milliseconds
76.65% <= 3 milliseconds
94.51% <= 4 milliseconds
98.96% <= 5 milliseconds
99.51% <= 6 milliseconds
99.64% <= 7 milliseconds
99.70% <= 8 milliseconds
99.79% <= 9 milliseconds
99.86% <= 10 milliseconds
99.88% <= 11 milliseconds
99.89% <= 12 milliseconds
99.92% <= 13 milliseconds
99.94% <= 14 milliseconds
99.96% <= 15 milliseconds
99.98% <= 16 milliseconds
99.99% <= 19 milliseconds
100.00% <= 20 milliseconds
100.00% <= 20 milliseconds
19223.38 requests per second

====== PING_BULK ======
  100000 requests completed in 5.53 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
21.31% <= 2 milliseconds
67.52% <= 3 milliseconds
89.93% <= 4 milliseconds
97.64% <= 5 milliseconds
99.46% <= 6 milliseconds
99.88% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
18079.91 requests per second

====== SET ======
  100000 requests completed in 4.74 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.07% <= 1 milliseconds
30.78% <= 2 milliseconds
88.57% <= 3 milliseconds
97.74% <= 4 milliseconds
99.37% <= 5 milliseconds
99.80% <= 6 milliseconds
99.89% <= 7 milliseconds
99.90% <= 8 milliseconds
99.90% <= 9 milliseconds
99.92% <= 10 milliseconds
99.94% <= 11 milliseconds
99.95% <= 12 milliseconds
99.99% <= 13 milliseconds
100.00% <= 13 milliseconds
21097.05 requests per second

====== GET ======
  100000 requests completed in 4.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
31.84% <= 2 milliseconds
90.94% <= 3 milliseconds
98.80% <= 4 milliseconds
99.66% <= 5 milliseconds
99.83% <= 6 milliseconds
99.85% <= 7 milliseconds
99.90% <= 8 milliseconds
99.94% <= 9 milliseconds
99.95% <= 10 milliseconds
99.96% <= 11 milliseconds
99.98% <= 12 milliseconds
100.00% <= 12 milliseconds
21533.16 requests per second

====== INCR ======
  100000 requests completed in 4.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
31.81% <= 2 milliseconds
91.06% <= 3 milliseconds
98.67% <= 4 milliseconds
99.51% <= 5 milliseconds
99.77% <= 6 milliseconds
99.87% <= 7 milliseconds
99.90% <= 8 milliseconds
99.94% <= 9 milliseconds
99.95% <= 13 milliseconds
99.95% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 202 milliseconds
21463.83 requests per second

====== LPUSH ======
  100000 requests completed in 5.43 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
24.02% <= 2 milliseconds
72.14% <= 3 milliseconds
90.00% <= 4 milliseconds
96.63% <= 5 milliseconds
99.04% <= 6 milliseconds
99.77% <= 7 milliseconds
99.87% <= 8 milliseconds
99.91% <= 9 milliseconds
99.94% <= 10 milliseconds
99.99% <= 11 milliseconds
100.00% <= 13 milliseconds
18426.39 requests per second

====== RPUSH ======
  100000 requests completed in 6.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
7.80% <= 2 milliseconds
33.13% <= 3 milliseconds
72.04% <= 4 milliseconds
92.12% <= 5 milliseconds
98.33% <= 6 milliseconds
99.61% <= 7 milliseconds
99.91% <= 8 milliseconds
99.98% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 10 milliseconds
14349.26 requests per second

====== LPOP ======
  100000 requests completed in 6.56 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
10.45% <= 2 milliseconds
42.80% <= 3 milliseconds
79.33% <= 4 milliseconds
94.09% <= 5 milliseconds
98.39% <= 6 milliseconds
99.38% <= 7 milliseconds
99.65% <= 8 milliseconds
99.78% <= 9 milliseconds
99.89% <= 10 milliseconds
99.94% <= 11 milliseconds
99.96% <= 12 milliseconds
99.98% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 14 milliseconds
15246.23 requests per second

====== RPOP ======
  100000 requests completed in 5.00 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
28.19% <= 2 milliseconds
83.15% <= 3 milliseconds
94.55% <= 4 milliseconds
98.18% <= 5 milliseconds
99.38% <= 6 milliseconds
99.74% <= 7 milliseconds
99.86% <= 8 milliseconds
99.93% <= 9 milliseconds
99.95% <= 10 milliseconds
99.95% <= 11 milliseconds
99.98% <= 12 milliseconds
100.00% <= 203 milliseconds
19992.00 requests per second

====== SADD ======
  100000 requests completed in 4.77 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
31.79% <= 2 milliseconds
89.36% <= 3 milliseconds
96.22% <= 4 milliseconds
98.55% <= 5 milliseconds
99.46% <= 6 milliseconds
99.75% <= 7 milliseconds
99.85% <= 8 milliseconds
99.88% <= 9 milliseconds
99.90% <= 10 milliseconds
99.92% <= 11 milliseconds
99.95% <= 12 milliseconds
99.96% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 15 milliseconds
20955.57 requests per second

====== HSET ======
  100000 requests completed in 4.74 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
32.05% <= 2 milliseconds
90.75% <= 3 milliseconds
97.67% <= 4 milliseconds
98.50% <= 5 milliseconds
99.28% <= 6 milliseconds
99.59% <= 7 milliseconds
99.70% <= 8 milliseconds
99.74% <= 9 milliseconds
99.75% <= 11 milliseconds
99.76% <= 12 milliseconds
99.83% <= 13 milliseconds
99.89% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 204 milliseconds
21088.15 requests per second

====== SPOP ======
  100000 requests completed in 4.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
32.12% <= 2 milliseconds
92.16% <= 3 milliseconds
99.03% <= 4 milliseconds
99.54% <= 5 milliseconds
99.78% <= 6 milliseconds
99.88% <= 7 milliseconds
99.94% <= 8 milliseconds
99.95% <= 12 milliseconds
99.95% <= 13 milliseconds
99.97% <= 14 milliseconds
100.00% <= 203 milliseconds
21602.94 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 4.62 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
33.28% <= 2 milliseconds
91.98% <= 3 milliseconds
98.72% <= 4 milliseconds
99.33% <= 5 milliseconds
99.69% <= 6 milliseconds
99.82% <= 7 milliseconds
99.85% <= 9 milliseconds
99.87% <= 10 milliseconds
99.89% <= 11 milliseconds
99.90% <= 12 milliseconds
99.95% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 14 milliseconds
21663.78 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 4.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
32.33% <= 2 milliseconds
91.73% <= 3 milliseconds
98.71% <= 4 milliseconds
99.39% <= 5 milliseconds
99.75% <= 6 milliseconds
99.90% <= 7 milliseconds
99.95% <= 8 milliseconds
99.99% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 10 milliseconds
21607.61 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 4.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
32.11% <= 2 milliseconds
90.22% <= 3 milliseconds
97.81% <= 4 milliseconds
98.90% <= 5 milliseconds
99.45% <= 6 milliseconds
99.71% <= 7 milliseconds
99.80% <= 8 milliseconds
99.86% <= 9 milliseconds
99.90% <= 10 milliseconds
99.95% <= 11 milliseconds
99.98% <= 12 milliseconds
99.99% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
21263.02 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 4.53 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
34.34% <= 2 milliseconds
93.82% <= 3 milliseconds
99.22% <= 4 milliseconds
99.64% <= 5 milliseconds
99.86% <= 6 milliseconds
99.96% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
22099.45 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 4.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.07% <= 1 milliseconds
33.31% <= 2 milliseconds
90.93% <= 3 milliseconds
97.57% <= 4 milliseconds
98.80% <= 5 milliseconds
99.40% <= 6 milliseconds
99.64% <= 7 milliseconds
99.78% <= 8 milliseconds
99.89% <= 9 milliseconds
99.96% <= 10 milliseconds
99.98% <= 11 milliseconds
100.00% <= 11 milliseconds
21372.09 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 5.15 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
28.84% <= 2 milliseconds
82.56% <= 3 milliseconds
93.79% <= 4 milliseconds
97.06% <= 5 milliseconds
98.68% <= 6 milliseconds
99.27% <= 7 milliseconds
99.54% <= 8 milliseconds
99.67% <= 9 milliseconds
99.74% <= 10 milliseconds
99.78% <= 11 milliseconds
99.83% <= 12 milliseconds
99.86% <= 13 milliseconds
99.88% <= 14 milliseconds
99.89% <= 15 milliseconds
99.90% <= 19 milliseconds
99.90% <= 20 milliseconds
99.92% <= 21 milliseconds
99.93% <= 22 milliseconds
99.94% <= 23 milliseconds
99.95% <= 24 milliseconds
99.95% <= 51 milliseconds
99.96% <= 52 milliseconds
99.96% <= 54 milliseconds
99.96% <= 55 milliseconds
99.97% <= 56 milliseconds
100.00% <= 57 milliseconds
100.00% <= 58 milliseconds
100.00% <= 204 milliseconds
19421.25 requests per second